rjackson-clconsulting/m8178106P/Src/os/ports/GCC/ARMCMx/MB9BF5xx/mb9bf50x.h
/******************************************************************************
 * GPIO_MODULE
 ******************************************************************************/
 typedef struct stc_gpio_epfr02_field
{
    union {
        struct {
            __IO uint32_t RTO10E0    : 1;
            __IO uint32_t RTO10E1    : 1;
            __IO uint32_t RTO11E0    : 1;
            __IO uint32_t RTO11E1    : 1;
            __IO uint32_t RTO12E0    : 1;
            __IO uint32_t RTO12E1    : 1;
            __IO uint32_t RTO13E0    : 1;
            __IO uint32_t RTO13E1    : 1;
            __IO uint32_t RTO14E0    : 1;
            __IO uint32_t RTO14E1    : 1;
            __IO uint32_t RTO15E0    : 1;
            __IO uint32_t RTO15E1    : 1;
            __IO uint32_t DTTI1C     : 1;
            uint32_t RESERVED1  : 3;
            __IO uint32_t DTTI1S0    : 1;
            __IO uint32_t DTTI1S1    : 1;
            __IO uint32_t FRCK1S0    : 1;
            __IO uint32_t FRCK1S1    : 1;
            __IO uint32_t IC10S0     : 1;
            __IO uint32_t IC10S1     : 1;
            __IO uint32_t IC10S2     : 1;
            __IO uint32_t IC11S0     : 1;
            __IO uint32_t IC11S1     : 1;
            __IO uint32_t IC11S2     : 1;
            __IO uint32_t IC12S0     : 1;
            __IO uint32_t IC12S1     : 1;
            __IO uint32_t IC12S2     : 1;
            __IO uint32_t IC13S0     : 1;
            __IO uint32_t IC13S1     : 1;
            __IO uint32_t IC13S2     : 1;
        };
        struct {
            __IO uint32_t RTO10    : 2;
            __IO uint32_t RTO11    : 2;
            __IO uint32_t RTO12    : 2;
            __IO uint32_t RTO13    : 2;
            __IO uint32_t RTO14    : 2;
            __IO uint32_t RTO15    : 2;
            uint32_t NOTDEF1       : 1;
            uint32_t RESERVED2     : 3;
            __IO uint32_t DTTI1S   : 2;
            __IO uint32_t FRCK1S   : 2;
            __IO uint32_t IC10     : 3;
            __IO uint32_t IC11     : 3;
            __IO uint32_t IC12     : 3;
            __IO uint32_t IC13     : 3;
        };
    };
} stc_gpio_epfr02_field_t;

 typedef struct stc_gpio_epfr07_field
{
    union {
        struct{
                uint32_t RESERVED1  : 4;
                __IO uint32_t SIN0S0     : 1;
                __IO uint32_t SIN0S1     : 1;
                __IO uint32_t SOT0B0     : 1;
                __IO uint32_t SOT0B1     : 1;
                __IO uint32_t SCK0B0     : 1;
                __IO uint32_t SCK0B1     : 1;
                __IO uint32_t SIN1S0     : 1;
                __IO uint32_t SIN1S1     : 1;
                __IO uint32_t SOT1B0     : 1;
                __IO uint32_t SOT1B1     : 1;
                __IO uint32_t SCK1B0     : 1;
                __IO uint32_t SCK1B1     : 1;
                __IO uint32_t SIN2S0     : 1;
                __IO uint32_t SIN2S1     : 1;
                __IO uint32_t SOT2B0     : 1;
                __IO uint32_t SOT2B1     : 1;
                __IO uint32_t SCK2B0     : 1;
                __IO uint32_t SCK2B1     : 1;
                __IO uint32_t SIN3S0     : 1;
                __IO uint32_t SIN3S1     : 1;
                __IO uint32_t SOT3B0     : 1;
                __IO uint32_t SOT3B1     : 1;
                __IO uint32_t SCK3B0     : 1;
                __IO uint32_t SCK3B1     : 1;
        };
        struct{
                uint32_t RESERVED2  : 4;
                __IO uint32_t SIN0  : 2;
                __IO uint32_t SOT0  : 2;
                __IO uint32_t SCK0  : 2;
                __IO uint32_t SIN1  : 2;
                __IO uint32_t SOT1  : 2;
                __IO uint32_t SCK1  : 2;
                __IO uint32_t SIN2  : 2;
                __IO uint32_t SOT2  : 2;
                __IO uint32_t SCK2  : 2;
                __IO uint32_t SIN3  : 2;
                __IO uint32_t SOT3  : 2;
                __IO uint32_t SCK3  : 2;
        };
    };
} stc_gpio_epfr07_field_t;

typedef struct stc_gpio_epfr08_field
{
    union {
        struct {
            __IO uint32_t RTS4E0     : 1;
            __IO uint32_t RTS4E1     : 1;
            __IO uint32_t CTS4S0     : 1;
            __IO uint32_t CTS4S1     : 1;
            __IO uint32_t SIN4S0     : 1;
            __IO uint32_t SIN4S1     : 1;
            __IO uint32_t SOT4B0     : 1;
            __IO uint32_t SOT4B1     : 1;
            __IO uint32_t SCK4B0     : 1;
            __IO uint32_t SCK4B1     : 1;
            __IO uint32_t SIN5S0     : 1;
            __IO uint32_t SIN5S1     : 1;
            __IO uint32_t SOT5B0     : 1;
            __IO uint32_t SOT5B1     : 1;
            __IO uint32_t SCK5B0     : 1;
            __IO uint32_t SCK5B1     : 1;
            __IO uint32_t SIN6S0     : 1;
            __IO uint32_t SIN6S1     : 1;
            __IO uint32_t SOT6B0     : 1;
            __IO uint32_t SOT6B1     : 1;
            __IO uint32_t SCK6B0     : 1;
            __IO uint32_t SCK6B1     : 1;
            __IO uint32_t SIN7S0     : 1;
            __IO uint32_t SIN7S1     : 1;
            __IO uint32_t SOT7B0     : 1;
            __IO uint32_t SOT7B1     : 1;
            __IO uint32_t SCK7B0     : 1;
            __IO uint32_t SCK7B1     : 1;
        };
        struct {
            __IO uint32_t RTS4     : 2;
            __IO uint32_t CTS4     : 2;
            __IO uint32_t SIN4     : 2;
            __IO uint32_t SOT4     : 2;
            __IO uint32_t SCK4     : 2;
            __IO uint32_t SIN5     : 2;
            __IO uint32_t SOT5     : 2;
            __IO uint32_t SCK5     : 2;
            __IO uint32_t SIN6     : 2;
            __IO uint32_t SOT6     : 2;
            __IO uint32_t SCK6     : 2;
            __IO uint32_t SIN7     : 2;
            __IO uint32_t SOT7     : 2;
            __IO uint32_t SCK7     : 2;
        };
    };
} stc_gpio_epfr08_field_t;
typedef struct stc_gpio_epfr11_field
{
    union {
        struct {
        __IO uint32_t MALE         : 1;
        __IO uint32_t MCS0XE       : 1;
        __IO uint32_t MAD01_07     : 7;
        __IO uint32_t MADATA       : 16;
        __IO uint32_t RELOC        : 1;
        __IO uint32_t RESERVED     : 6;
        };
        struct {
  __IO uint32_t UEALEE     : 1;
  __IO uint32_t UECS0E     : 1;
  __IO uint32_t UEA01E     : 1;
  __IO uint32_t UEA02E     : 1;
  __IO uint32_t UEA03E     : 1;
  __IO uint32_t UEA04E     : 1;
  __IO uint32_t UEA05E     : 1;
  __IO uint32_t UEA06E     : 1;
  __IO uint32_t UEA07E     : 1;
  __IO uint32_t UED00B     : 1;
  __IO uint32_t UED01B     : 1;
  __IO uint32_t UED02B     : 1;
  __IO uint32_t UED03B     : 1;
  __IO uint32_t UED04B     : 1;
  __IO uint32_t UED05B     : 1;
  __IO uint32_t UED06B     : 1;
  __IO uint32_t UED07B     : 1;
  __IO uint32_t UED08B     : 1;
  __IO uint32_t UED09B     : 1;
  __IO uint32_t UED10B     : 1;
  __IO uint32_t UED11B     : 1;
  __IO uint32_t UED12B     : 1;
  __IO uint32_t UED13B     : 1;
  __IO uint32_t UED14B     : 1;
  __IO uint32_t UED15B     : 1;
  __IO uint32_t UERLC      : 1;
  };
  };
} stc_gpio_epfr11_field_t;							// questo è in piu rispetto al mb9b500r.h

