rjackson-clconsulting/m8178106P/Src/os/ports/GCC/ARMCMx/MB9BF5xx/mb9bf50x.h
typedef struct stc_gpio_epfr12_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t TIOA8E0    : 1;
  __IO uint32_t TIOA8E1    : 1;
  __IO uint32_t TIOB8S0    : 1;
  __IO uint32_t TIOB8S1    : 1;
       uint32_t RESERVED2  : 2;
  __IO uint32_t TIOA9S0    : 1;
  __IO uint32_t TIOA9S1    : 1;
  __IO uint32_t TIOA9E0    : 1;
  __IO uint32_t TIOA9E1    : 1;
  __IO uint32_t TIOB9S0    : 1;
  __IO uint32_t TIOB9S1    : 1;
       uint32_t RESERVED3  : 4;
  __IO uint32_t TIOA10E0   : 1;
  __IO uint32_t TIOA10E1   : 1;
  __IO uint32_t TIOB10S0   : 1;
  __IO uint32_t TIOB10S1   : 1;
       uint32_t RESERVED4  : 2;
  __IO uint32_t TIOA11S0   : 1;
  __IO uint32_t TIOA11S1   : 1;
  __IO uint32_t TIOA11E0   : 1;
  __IO uint32_t TIOA11E1   : 1;
  __IO uint32_t TIOB11S0   : 1;
  __IO uint32_t TIOB11S1   : 1;
} stc_gpio_epfr12_field_t;							// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_epfr13_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t TIOA12E0   : 1;
  __IO uint32_t TIOA12E1   : 1;
  __IO uint32_t TIOB12S0   : 1;
  __IO uint32_t TIOB12S1   : 1;
       uint32_t RESERVED2  : 2;
  __IO uint32_t TIOA13S0   : 1;
  __IO uint32_t TIOA13S1   : 1;
  __IO uint32_t TIOA13E0   : 1;
  __IO uint32_t TIOA13E1   : 1;
  __IO uint32_t TIOB13S0   : 1;
  __IO uint32_t TIOB13S1   : 1;
       uint32_t RESERVED3  : 4;
  __IO uint32_t TIOA14E0   : 1;
  __IO uint32_t TIOA14E1   : 1;
  __IO uint32_t TIOB14S0   : 1;
  __IO uint32_t TIOB14S1   : 1;
       uint32_t RESERVED4  : 2;
  __IO uint32_t TIOA15S0   : 1;
  __IO uint32_t TIOA15S1   : 1;
  __IO uint32_t TIOA15E0   : 1;
  __IO uint32_t TIOA15E1   : 1;
  __IO uint32_t TIOB15S0   : 1;
  __IO uint32_t TIOB15S1   : 1;
} stc_gpio_epfr13_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_epfr14_field
{
  __IO uint32_t QAIN2S0    : 1;
  __IO uint32_t QAIN2S1    : 1;
  __IO uint32_t QBIN2S0    : 1;
  __IO uint32_t QBIN2S1    : 1;
  __IO uint32_t QZIN2S0    : 1;
  __IO uint32_t QZIN2S1    : 1;
       uint32_t RESERVED1  : 12;
  __IO uint32_t E_TD0E     : 1;
  __IO uint32_t E_TD1E     : 1;
  __IO uint32_t E_TE0E     : 1;
  __IO uint32_t E_TE1E     : 1;
  __IO uint32_t E_MC0E     : 1;
  __IO uint32_t E_MC1B     : 1;
  __IO uint32_t E_MD0B     : 1;
  __IO uint32_t E_MD1B     : 1;
  __IO uint32_t E_CKE      : 1;
  __IO uint32_t E_PSE      : 1;
  __IO uint32_t E_SPLC0    : 1;
  __IO uint32_t E_SPLC1    : 1;
} stc_gpio_epfr14_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_epfr15_field
{
    union {
        struct {
            __IO uint32_t EINT16S0   : 1;
            __IO uint32_t EINT16S1   : 1;
            __IO uint32_t EINT17S0   : 1;
            __IO uint32_t EINT17S1   : 1;
            __IO uint32_t EINT18S0   : 1;
            __IO uint32_t EINT18S1   : 1;
            __IO uint32_t EINT19S0   : 1;
            __IO uint32_t EINT19S1   : 1;
            __IO uint32_t EINT20S0   : 1;
            __IO uint32_t EINT20S1   : 1;
            __IO uint32_t EINT21S0   : 1;
            __IO uint32_t EINT21S1   : 1;
            __IO uint32_t EINT22S0   : 1;
            __IO uint32_t EINT22S1   : 1;
            __IO uint32_t EINT23S0   : 1;
            __IO uint32_t EINT23S1   : 1;
            __IO uint32_t EINT24S0   : 1;
            __IO uint32_t EINT24S1   : 1;
            __IO uint32_t EINT25S0   : 1;
            __IO uint32_t EINT25S1   : 1;
            __IO uint32_t EINT26S0   : 1;
            __IO uint32_t EINT26S1   : 1;
            __IO uint32_t EINT27S0   : 1;
            __IO uint32_t EINT27S1   : 1;
            __IO uint32_t EINT28S0   : 1;
            __IO uint32_t EINT28S1   : 1;
            __IO uint32_t EINT29S0   : 1;
            __IO uint32_t EINT29S1   : 1;
            __IO uint32_t EINT30S0   : 1;
            __IO uint32_t EINT30S1   : 1;
            __IO uint32_t EINT31S0   : 1;
            __IO uint32_t EINT31S1   : 1;
        };
        struct {
            __IO uint32_t EINT16   : 2;
            __IO uint32_t EINT17   : 2;
            __IO uint32_t EINT18   : 2;
            __IO uint32_t EINT19   : 2;
            __IO uint32_t EINT20   : 2;
            __IO uint32_t EINT21   : 2;
            __IO uint32_t EINT22   : 2;
            __IO uint32_t EINT23   : 2;
            __IO uint32_t EINT24   : 2;
            __IO uint32_t EINT25   : 2;
            __IO uint32_t EINT26   : 2;
            __IO uint32_t EINT27   : 2;
            __IO uint32_t EINT28   : 2;
            __IO uint32_t EINT29   : 2;
            __IO uint32_t EINT30   : 2;
            __IO uint32_t EINT31   : 2;
        };
    };
} stc_gpio_epfr15_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr0_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
} stc_gpio_pzr0_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr1_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pzr1_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr2_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
} stc_gpio_pzr2_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr3_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pzr3_field_t;								// questo è in piu rispetto al mb9b500r.h

