rjackson-clconsulting/m8178106P/Src/os/ports/GCC/ARMCMx/MB9BF5xx/mb9bf50x.h
typedef struct stc_gpio_pzr4_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
} stc_gpio_pzr4_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr5_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
} stc_gpio_pzr5_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr6_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
} stc_gpio_pzr6_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr7_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pzr7_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr8_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
} stc_gpio_pzr8_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzr9_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
} stc_gpio_pzr9_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzra_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
} stc_gpio_pzra_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzrb_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
} stc_gpio_pzrb_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzrc_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
  __IO uint32_t P7         : 1;
  __IO uint32_t P8         : 1;
  __IO uint32_t P9         : 1;
  __IO uint32_t PA         : 1;
  __IO uint32_t PB         : 1;
  __IO uint32_t PC         : 1;
  __IO uint32_t PD         : 1;
  __IO uint32_t PE         : 1;
  __IO uint32_t PF         : 1;
} stc_gpio_pzrc_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzrd_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
} stc_gpio_pzrd_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzre_field
{
  __IO uint32_t P0         : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
} stc_gpio_pzre_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_pzrf_field
{
  __IO uint32_t P0         : 1;
  __IO uint32_t P1         : 1;
  __IO uint32_t P2         : 1;
  __IO uint32_t P3         : 1;
  __IO uint32_t P4         : 1;
  __IO uint32_t P5         : 1;
  __IO uint32_t P6         : 1;
} stc_gpio_pzrf_field_t;								// questo è in piu rispetto al mb9b500r.h

typedef struct stc_gpio_ade_field
{
  __IO uint32_t AN00       : 1;
  __IO uint32_t AN01       : 1;
  __IO uint32_t AN02       : 1;
  __IO uint32_t AN03       : 1;
  __IO uint32_t AN04       : 1;
  __IO uint32_t AN05       : 1;
  __IO uint32_t AN06       : 1;
  __IO uint32_t AN07       : 1;
  __IO uint32_t AN08       : 1;
  __IO uint32_t AN09       : 1;
  __IO uint32_t AN10       : 1;
  __IO uint32_t AN11       : 1;
  __IO uint32_t AN12       : 1;
  __IO uint32_t AN13       : 1;
  __IO uint32_t AN14       : 1;
  __IO uint32_t AN15       : 1;
  __IO uint32_t AN16       : 1;
  __IO uint32_t AN17       : 1;
  __IO uint32_t AN18       : 1;
  __IO uint32_t AN19       : 1;
  __IO uint32_t AN20       : 1;
  __IO uint32_t AN21       : 1;
  __IO uint32_t AN22       : 1;
  __IO uint32_t AN23       : 1;
  __IO uint32_t AN24       : 1;
  __IO uint32_t AN25       : 1;
  __IO uint32_t AN26       : 1;
  __IO uint32_t AN27       : 1;
  __IO uint32_t AN28       : 1;
  __IO uint32_t AN29       : 1;
  __IO uint32_t AN30       : 1;
  __IO uint32_t AN31       : 1;
} stc_gpio_ade_field_t;

/* General purpose I/O registers */
typedef struct
{
  __IO uint32_t PFR0;
  __IO uint32_t PFR1;
  __IO uint32_t PFR2;
  __IO uint32_t PFR3;
  __IO uint32_t PFR4;
  __IO uint32_t PFR5;
  __IO uint32_t PFR6;
  __IO uint32_t PFR7;
  __IO uint32_t PFR8;
        uint8_t RESERVED0[220];
  __IO uint32_t PCR0;
  __IO uint32_t PCR1;
  __IO uint32_t PCR2;
  __IO uint32_t PCR3;
  __IO uint32_t PCR4;
  __IO uint32_t PCR5;
  __IO uint32_t PCR6;
  __IO uint32_t PCR7;
        uint8_t RESERVED1[224];
  __IO uint32_t DDR0;
  __IO uint32_t DDR1;
  __IO uint32_t DDR2;
  __IO uint32_t DDR3;
  __IO uint32_t DDR4;
  __IO uint32_t DDR5;
  __IO uint32_t DDR6;
  __IO uint32_t DDR7;
  __IO uint32_t DDR8;
        uint8_t RESERVED2[220];
  __IO uint32_t PDIR0;
  __IO uint32_t PDIR1;
  __IO uint32_t PDIR2;
  __IO uint32_t PDIR3;
  __IO uint32_t PDIR4;
  __IO uint32_t PDIR5;
  __IO uint32_t PDIR6;
  __IO uint32_t PDIR7;
  __IO uint32_t PDIR8;
        uint8_t RESERVED3[220];
  __IO uint32_t PDOR0;
  __IO uint32_t PDOR1;
  __IO uint32_t PDOR2;
  __IO uint32_t PDOR3;
  __IO uint32_t PDOR4;
  __IO uint32_t PDOR5;
  __IO uint32_t PDOR6;
  __IO uint32_t PDOR7;
  __IO uint32_t PDOR8;
        uint8_t RESERVED4[220];
  union {
    __IO uint32_t ADE;
    stc_gpio_ade_field_t ADE_f;
  };
        uint8_t RESERVED5[124];
  __IO uint32_t SPSR;
        uint8_t RESERVED6[124];
  __IO uint32_t EPFR00;
  __IO uint32_t EPFR01;
  union {
    __IO uint32_t EPFR02;
    stc_gpio_epfr02_field_t EPFR02_f;
  };
    uint8_t RESERVED7[4];
  __IO uint32_t EPFR04;
  __IO uint32_t EPFR05;
  __IO uint32_t EPFR06;
  union {
    __IO uint32_t EPFR07;
    stc_gpio_epfr07_field_t EPFR07_f;
  };
  union {
    __IO uint32_t EPFR08;
    stc_gpio_epfr08_field_t EPFR08_f;
  };
  __IO uint32_t EPFR09;
  __IO uint32_t EPFR10;
  union {
    __IO uint32_t EPFR11;
	stc_gpio_epfr11_field_t EPFR11_f;				// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t EPFR12;
	stc_gpio_epfr12_field_t EPFR12_f;				// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t EPFR13;
	stc_gpio_epfr13_field_t EPFR13_f;				// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t EPFR14;
	stc_gpio_epfr14_field_t EPFR14_f;				// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t EPFR15;
	stc_gpio_epfr15_field_t EPFR15_f;				// questo è in piu rispetto al mb9b500r.h
  };
        uint8_t RESERVED8[192];
  union {
    __IO uint32_t PZR0;
	stc_gpio_pzr0_field_t PZR0_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR1;
	stc_gpio_pzr1_field_t PZR1_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR2;
	stc_gpio_pzr2_field_t PZR2_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR3;
	stc_gpio_pzr3_field_t PZR3_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR4;
	stc_gpio_pzr4_field_t PZR4_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR5;
	stc_gpio_pzr5_field_t PZR5_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR6;
	stc_gpio_pzr6_field_t PZR6_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR7;
	stc_gpio_pzr7_field_t PZR7_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR8;
	stc_gpio_pzr8_field_t PZR8_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZR9;
	stc_gpio_pzr9_field_t PZR9_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZRA;
	stc_gpio_pzra_field_t PZRA_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZRB;
	stc_gpio_pzrb_field_t PZRB_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZRC;
	stc_gpio_pzrc_field_t PZRC_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZRD;
	stc_gpio_pzrd_field_t PZRD_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZRE;
	stc_gpio_pzre_field_t PZRE_f;					// questo è in piu rispetto al mb9b500r.h
  };
  union {
    __IO uint32_t PZRF;
	stc_gpio_pzrf_field_t PZRF_f;					// questo è in piu rispetto al mb9b500r.h
  };

}FM3_GPIO_TypeDef;

